{
    "2FA deshabilitado exitosamente": "2FA successfully disabled",
    "2FA habilitado exitosamente": "2FA successfully enabled",
    "Acceder a tu cuenta": "Login to your account",
    "Acciones": "Actions",
    "Activo": "Active",
    "Actualiza la información del usuario y su rol.": "Update user information and role.",
    "Actualizar contraseña": "Update Password",
    "Actualiza la información de perfil y la dirección de correo electrónico de tu cuenta.": "Update your account's profile information and email address.",
    "Algo salió mal": "Something went wrong",
    "Añade seguridad adicional a tu cuenta utilizando autenticación de dos factores.": "Add additional security to your account using two-factor authentication.",
    "Añade un nuevo usuario al sistema. Recibirá un correo de invitación para establecer su contraseña.": "Add a new user to the system. They will receive an email invitation to set their password.",
    "Añadir usuario": "Add User",
    "Asegúrate de que tu cuenta esté usando una contraseña larga y aleatoria para mantenerte seguro.": "Ensure your account is using a long, random password to stay secure.",
    "Autenticación de dos factores": "Two-Factor Authentication",
    "Bienvenido": "Welcome",
    "Busca por nombre o correo electrónico...": "Search by name or email...",
    "Buscar": "Search",
    "Cancelar": "Cancel",
    "Cerrar sesión": "Log out",
    "Código": "Code",
    "Código QR de 2FA generado": "2FA QR Code generated",
    "Confirmar": "Confirm",
    "Confirmar contraseña": "Confirm Password",
    "Confirmar nueva contraseña": "Confirm new password",
    "Confirmando...": "Confirming...",
    "Contraseña": "Password",
    "Contraseña actual": "Current Password",
    "Contraseña actualizada exitosamente": "Password updated successfully",
    "Correo de restablecimiento de contraseña enviado": "Password reset email sent",
    "Correo electrónico": "Email",
    "Crear usuario": "Create User",
    "Creado": "Created",
    "Dashboard": "Dashboard",
    "Deshabilitar": "Disable",
    "Deshabilitar 2FA": "Disable 2FA",
    "Deshabilitar usuario": "Disable User",
    "Deshabilitado": "Disabled",
    "Deshabilitando...": "Disabling...",
    "Editar": "Edit",
    "Editar usuario": "Edit User",
    "Eliminar cuenta": "Delete Account",
    "Enlace de restablecimiento de contraseña enviado": "Password reset link sent",
    "Enviar": "Send",
    "Enviar correo de restablecimiento": "Send Reset Email",
    "Error al actualizar el estado del usuario": "Failed to update user status",
    "Error al actualizar el usuario": "Failed to update user",
    "Error al crear el usuario": "Failed to create user",
    "Error al eliminar el usuario": "Failed to delete user",
    "Error al enviar el correo de restablecimiento": "Failed to send reset email",
    "Estos códigos de recuperación se mostrarán solo una vez. Guárdalos en un gestor de contraseñas seguro de inmediato. Pueden usarse para recuperar el acceso a tu cuenta si pierdes tu dispositivo de autenticación de dos factores.": "These recovery codes will only be shown once. Store them in a secure password manager immediately. They can be used to recover access to your account if your two-factor authentication device is lost.",
    "Esta acción no se puede deshacer.": "This action cannot be undone.",
    "Estado": "Status",
    "Estás seguro de que deseas deshabilitar": "Are you sure you want to disable",
    "Estás seguro de que deseas eliminar": "Are you sure you want to delete",
    "Estás seguro de que deseas eliminar tu cuenta?": "Are you sure you want to delete your account?",
    "Estás seguro de que deseas habilitar": "Are you sure you want to enable",
    "Gestión de usuarios": "User Management",
    "Gestiona usuarios y sus roles": "Manage users and their roles",
    "Guardar cambios": "Save Changes",
    "Habilitar": "Enable",
    "Habilitar 2FA": "Enable 2FA",
    "Habilitar usuario": "Enable User",
    "Habilitando...": "Enabling...",
    "Hemos enviado un enlace para restablecer tu contraseña a tu dirección de correo electrónico. Por favor, revisa tu bandeja de entrada y sigue las instrucciones para restablecer tu contraseña.": "We have sent a password reset link to your email address. Please check your inbox and follow the instructions to reset your password.",
    "Hubo un error deshabilitando 2FA": "There was an error disabling 2FA",
    "Hubo un error habilitando 2FA": "There was an error enabling 2FA",
    "Importante:": "Important:",
    "Iniciar sesión": "Login",
    "Información de perfil": "Profile Information",
    "Ingresa la contraseña de un solo uso de tu aplicación de autenticación": "Please enter the one-time password from your authenticator app",
    "Ingresa la dirección de correo electrónico": "Enter email address",
    "Ingresa el nombre completo": "Enter full name",
    "Ingresa tu correo electrónico para acceder a tu cuenta": "Enter your email below to login to your account",
    "Ingresa tu correo electrónico para registrar tu cuenta": "Enter your email below to register to your account",
    "Ingresa tu nombre": "Enter your name",
    "Ingresar": "Sign in",
    "Intenta de nuevo": "Try again",
    "La autenticación de dos factores no está habilitada. Te recomendamos habilitarla.": "Two-factor authentication is not enabled. We recommend enabling it.",
    "Lo recordaste?": "Did you remember?",
    "No se encontraron usuarios": "No users found",
    "Nombre": "Name",
    "Nueva contraseña": "New password",
    "Para completar la habilitación de autenticación de dos factores, escanea el siguiente código QR con tu aplicación autenticadora del teléfono o ingresa la clave de configuración y proporciona el código OTP generado.": "To finish enabling two-factor authentication, scan the following QR code using your phone's authenticator application or enter the setup key and provide the generated OTP code.",
    "Para deshabilitar la autenticación de dos factores, debes confirmar tu contraseña.": "To disable two-factor authentication, you must confirm your password.",
    "Para habilitar la autenticación de dos factores, debes confirmar tu contraseña.": "To start enabling two-factor authentication, you must confirm your password.",
    "Perfil": "Profile",
    "Perfil actualizado exitosamente": "Profile updated successfully",
    "Podrán iniciar sesión nuevamente.": "They will be able to log in again.",
    "Por favor, ingresa tu contraseña para confirmar que deseas eliminar permanentemente tu cuenta.": "Please enter your password to confirm you would like to permanently delete your account.",
    "Por favor, ingresa tu nueva contraseña a continuación para restablecer la contraseña de tu cuenta.": "Please enter your new password below to reset your account password.",
    "Por favor, verifica tu correo electrónico haciendo clic en el enlace que te enviamos. Si no lo has recibido, podemos enviar un nuevo enlace de verificación.": "Please verify your email address by clicking the link in the email we sent you. If you haven't received it, we can send a new verification link.",
    "Recuerdas tu contraseña?": "Remember your password?",
    "Registrar cuenta": "Register Account",
    "Registrar tu cuenta": "Register your account",
    "Registrarse": "Register",
    "Reenviar enlace de verificación": "Resend verification link",
    "Restablecer contraseña": "Reset Password",
    "Revisa tu correo": "Check your email",
    "Rol": "Role",
    "Se ha enviado un nuevo enlace de verificación a tu correo electrónico.": "A new verification link has been sent to your email address.",
    "Seguridad": "Security",
    "Selecciona un rol": "Select a role",
    "Serán desconectados y no podrán acceder al sistema.": "They will be logged out and unable to access the system.",
    "Sin problema. Cuéntanos tu dirección de correo electrónico y te enviaremos un enlace para restablecer tu contraseña.": "No problem. Let us know your email address and we will email you a password reset link.",
    "Todos los estados": "All Statuses",
    "Todos los roles": "All Roles",
    "Tu Landing va aquí": "Welcome to your Landing",
    "Una vez que tu cuenta sea eliminada, todos sus recursos y datos se eliminarán permanentemente. Antes de eliminar tu cuenta, descarga cualquier dato o información que desees conservar.": "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.",
    "Una vez que tu cuenta sea eliminada, todos sus recursos y datos se eliminarán permanentemente. Por favor, ingresa tu contraseña para confirmar que deseas eliminar permanentemente tu cuenta.": "Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.",
    "Usuario actualizado exitosamente": "User updated successfully",
    "Usuario creado exitosamente": "User created successfully",
    "Usuario eliminado exitosamente": "User deleted successfully",
    "Verifica tu correo electrónico": "Verify your email",
    "Verificar correo electrónico": "Verify Email",
    "Volver a iniciar sesión": "Return to login",
    "Volver a usuarios": "Back to Users",
    "Ya tienes habilitado 2FA.": "You've already enabled 2FA.",
    "¿Enviar un correo de restablecimiento de contraseña a": "Send a password reset email to",
    "¿No recibiste el correo?": "Didn't receive the email?",
    "¿No tienes cuenta?": "Don't have an account?",
    "¿Olvidaste tu contraseña?": "Forgot your password?",
    "¿Recuerdas tu contraseña?": "Remember your password?",
    "¿Ya tienes cuenta?": "Already have an account?"
}
